//
// Created by MRV on 5/17/2022.
//

#ifndef READWRITEBINARYSTUDENT_SUPPORT_H
#define READWRITEBINARYSTUDENT_SUPPORT_H
#include <random>
#include <vector>
double my_random_double(double a, double b) {
    if (b!=a){
        std::random_device rd;
        std::mt19937_64 mersenne(rd());
        std::uniform_real_distribution<double> urd(a, b);
        return urd(mersenne);
    }
    else return b;
}
int my_random_int(int a, int b) {
    if (b!=a){
        std::random_device rd;
        std::mt19937_64 mersenne(rd());
        std::uniform_int_distribution<int> uid(a, b);
        return uid(mersenne);
    }
    else return b;
}
std::string my_random_family(){
    std::vector<std::string> fams{
            "Иванов",
            "Васильев",
            "Петров",
            "Смирнов",
            "Михайлов",
            "Фёдоров",
            "Соколов",
            "Яковлев",
            "Попов",
            "Андреев",
            "Алексеев",
            "Александров",
            "Лебедев",
            "Григорьев",
            "Степанов",
            "Семёнов",
            "Павлов",
            "Богданов",
            "Николаев",
            "Дмитриев",
            "Егоров",
            "Волков",
            "Кузнецов",
            "Никитин",
            "Соловьёв",
            "Тимофеев",
            "Орлов",
            "Афанасьев",
            "Филиппов",
            "Сергеев",
            "Захаров",
            "Матвеев",
            "Виноградов",
            "Кузьмин",
            "Максимов",
            "Козлов",
            "Ильин",
            "Герасимов",
            "Марков",
            "Новиков",
            "Морозов",
            "Романов",
            "Осипов",
            "Макаров",
            "Зайцев",
            "Беляев",
            "Гаврилов",
            "Антонов",
            "Ефимов",
            "Леонтьев",
            "Давыдов",
            "Гусев",
            "Данилов",
            "Киселёв",
            "Сорокин",
            "Тихомиров",
            "Крылов",
            "Никифоров",
            "Кондратьев",
            "Кудрявцев",
            "Борисов",
            "Жуков",
            "Воробьёв",
            "Щербаков",
            "Поляков",
            "Савельев",
            "Шмидт",
            "Трофимов",
            "Чистяков",
            "Баранов",
            "Сидоров",
            "Соболев",
            "Карпов",
            "Белов",
            "Миллер",
            "Титов",
            "Львов",
            "Фролов",
            "Игнатьев",
            "Комаров",
            "Прокофьев",
            "Быков",
            "Абрамов",
            "Голубев",
            "Пономарёв",
            "Покровский",
            "Мартынов",
            "Кириллов",
            "Шульц",
            "Миронов",
            "Фомин",
            "Власов",
            "Троицкий",
            "Федотов",
            "Назаров",
            "Ушаков",
            "Денисов",
            "Константинов",
            "Воронин",
            "Наумов"
    };
    return fams[my_random_int(0,99)];
}
#endif //READWRITEBINARYSTUDENT_SUPPORT_H
